KunYi/nRF5_SDK_Thread/examples/thread/app_utils/thread_coap_utils.c
/**
 * Copyright (c) 2017 - 2018, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */

#include "thread_coap_utils.h"

#include "app_timer.h"
#include "bsp_thread.h"
#include "nrf_assert.h"
#include "nrf_log.h"
#include "sdk_config.h"
#include "thread_utils.h"

#include <openthread/ip6.h>
#include <openthread/link.h>
#include <openthread/thread.h>
#include <openthread/platform/alarm-milli.h>

#define RESPONSE_POLL_PERIOD 100

APP_TIMER_DEF(m_provisioning_timer);
APP_TIMER_DEF(m_led_timer);

static uint32_t m_poll_period;

static const otIp6Address m_unspecified_ipv6 =
{
    .mFields =
    {
        .m8 = {0}
    }
};

static thread_coap_configuration_t m_thread_coap_configuration =
{
    .coap_server_enabled                = false,
    .coap_client_enabled                = false,
    .coap_cloud_enabled                 = false,
    .configurable_led_blinking_enabled  = false,
};

static void thread_coap_utils_handler_default(void                * p_context,
                                              otCoapHeader        * p_header,
                                              otMessage           * p_message,
                                              const otMessageInfo * p_message_info)
{
    (void)p_context;
    (void)p_header;
    (void)p_message;
    (void)p_message_info;

    NRF_LOG_INFO("Received CoAP message that does not match any request or resource\r\n");
}

static thread_coap_utils_status_t m_coap_status =
{
    .provisioning_enabled = false,
    .provisioning_expiry  = 0,
    .led_blinking_is_on   = false,
    .peer_address         =
    {
        .mFields =
        {
            .m8 = {0}
        }
    },
    .multicast_light_on   = false,
};

static uint32_t poll_period_response_set(otInstance * p_instance)
{
    uint32_t error;

    do
    {
        if (otThreadGetLinkMode(p_instance).mRxOnWhenIdle)
        {
            error = NRF_ERROR_INVALID_STATE;
            break;
        }

        if (!m_poll_period)
        {
            m_poll_period = otLinkGetPollPeriod(p_instance);
            NRF_LOG_INFO("Poll Period: %dms set\r\n", RESPONSE_POLL_PERIOD);
            otLinkSetPollPeriod(p_instance, RESPONSE_POLL_PERIOD);

            error =  NRF_SUCCESS;
        }
        else
        {
            error = NRF_ERROR_BUSY;
        }
    } while (false);

    return error;
}


static uint32_t poll_period_restore(otInstance * p_instance)
{
    uint32_t error;

    do
    {
        if (otThreadGetLinkMode(p_instance).mRxOnWhenIdle)
        {
            error = NRF_ERROR_INVALID_STATE;
            break;
        }

        if (m_poll_period)
        {
            otLinkSetPollPeriod(p_instance, m_poll_period);
            NRF_LOG_INFO("Poll Period: %dms restored\r\n", m_poll_period);
            m_poll_period = 0;

            error =  NRF_SUCCESS;
        }
        else
        {
            error = NRF_ERROR_BUSY;
        }
    } while (false);

    return error;
}

static void light_changed_default(thread_coap_utils_light_command_t light_command)
{
    switch (light_command)
    {
        case LIGHT_ON:
            LEDS_ON(BSP_LED_3_MASK);
            break;

        case LIGHT_OFF:
            LEDS_OFF(BSP_LED_3_MASK);
            break;

        case LIGHT_TOGGLE:
            LEDS_INVERT(BSP_LED_3_MASK);
            break;

        default:
            break;
    }
}

static light_changed_handler_t m_light_changed = light_changed_default;

static void thread_coap_utils_provisioning_request_handler(void                * p_context,
                                                           otCoapHeader        * p_header,
                                                           otMessage           * p_message,
                                                           const otMessageInfo * p_message_info)
{
    (void)p_message;
    otMessageInfo message_info;

    if (!thread_coap_utils_provisioning_is_enabled())
    {
        return;
    }

    if ((otCoapHeaderGetType(p_header) == OT_COAP_TYPE_NON_CONFIRMABLE) &&
        (otCoapHeaderGetCode(p_header) == OT_COAP_CODE_GET))
    {
        message_info = *p_message_info;
        memset(&message_info.mSockAddr, 0, sizeof(message_info.mSockAddr));
        if (thread_coap_utils_provisioning_response_send(
                p_context, p_header, &message_info) == OT_ERROR_NONE)
        {
                thread_coap_utils_provisioning_enable(false);
        }
    }
}

static void thread_coap_utils_light_request_handler(void                * p_context,
                                                    otCoapHeader        * p_header,
                                                    otMessage           * p_message,
                                                    const otMessageInfo * p_message_info)
{
    uint8_t command;
    do
    {
        if (otCoapHeaderGetType(p_header) != OT_COAP_TYPE_CONFIRMABLE &&
            otCoapHeaderGetType(p_header) != OT_COAP_TYPE_NON_CONFIRMABLE)
        {
            break;
        }

        if (otCoapHeaderGetCode(p_header) != OT_COAP_CODE_PUT)
        {
            break;
        }

