KunYi/nRF5_SDK_Thread/examples/thread/app_utils/thread_coap_utils.c
        if (otMessageRead(p_message, otMessageGetOffset(p_message), &command, 1) != 1)
        {
            NRF_LOG_INFO("light handler - missing command\r\n");
        }

        m_light_changed((thread_coap_utils_light_command_t)command);

        switch (command)
        {
            case LIGHT_ON:
                if (m_thread_coap_configuration.configurable_led_blinking_enabled)
                {
                    thread_coap_utils_light_blinking_is_on_set(true);
                }
                break;

            case LIGHT_OFF:
                if (m_thread_coap_configuration.configurable_led_blinking_enabled)
                {
                    thread_coap_utils_light_blinking_is_on_set(false);
                }
                break;

            case LIGHT_TOGGLE:
                if (m_thread_coap_configuration.configurable_led_blinking_enabled)
                {
                    thread_coap_utils_light_blinking_is_on_set(
                                            !thread_coap_utils_light_blinking_is_on_get());
                }
                break;

            default:
                break;
        }

        if (otCoapHeaderGetType(p_header) == OT_COAP_TYPE_CONFIRMABLE)
        {
            thread_coap_utils_light_response_send(p_context, p_header, p_message_info);
        }

    } while (false);
}

static thread_coap_utils_resources_t m_coap_resources = {
    .provisioning_resource = {"provisioning", thread_coap_utils_provisioning_request_handler, NULL,
                              NULL},
    .light_resource        = {"light", thread_coap_utils_light_request_handler, NULL, NULL},
};

static void thread_coap_configuration_set(const thread_coap_configuration_t * p_thread_coap_configuration)
{
    m_thread_coap_configuration = *p_thread_coap_configuration;
}

void thread_coap_utils_init(const thread_coap_configuration_t * p_thread_coap_configuration)
{
    otError error = otCoapStart(thread_ot_instance_get(), OT_DEFAULT_COAP_PORT);
    ASSERT(error == OT_ERROR_NONE);

    otCoapSetDefaultHandler(thread_ot_instance_get(), thread_coap_utils_handler_default, NULL);

    thread_coap_configuration_set(p_thread_coap_configuration);

    if (m_thread_coap_configuration.coap_server_enabled)
    {
        m_coap_resources.light_resource.mContext        = thread_ot_instance_get();
        m_coap_resources.provisioning_resource.mContext = thread_ot_instance_get();

        error = otCoapAddResource(thread_ot_instance_get(), &m_coap_resources.light_resource);
        ASSERT(error == OT_ERROR_NONE);

        error = otCoapAddResource(thread_ot_instance_get(), &m_coap_resources.provisioning_resource);
        ASSERT(error == OT_ERROR_NONE);
    }
}

void thread_coap_utils_deinit(void)
{
    otError error = otCoapStop(thread_ot_instance_get());
    ASSERT(error == OT_ERROR_NONE);

    otCoapSetDefaultHandler(thread_ot_instance_get(), thread_coap_utils_handler_default, NULL);

    if (m_thread_coap_configuration.coap_server_enabled)
    {
        m_coap_resources.light_resource.mContext        = NULL;
        m_coap_resources.provisioning_resource.mContext = NULL;

        otCoapRemoveResource(thread_ot_instance_get(), &m_coap_resources.light_resource);
        otCoapRemoveResource(thread_ot_instance_get(), &m_coap_resources.provisioning_resource);
    }
}

thread_coap_configuration_t * thread_coap_configuration_get()
{
    return &m_thread_coap_configuration;
}

void thread_coap_utils_peer_addr_set(const otIp6Address * p_peer_addr)
{
    m_coap_status.peer_address = *p_peer_addr;
}

otIp6Address * thread_coap_utils_peer_addr_get(void)
{
    return &m_coap_status.peer_address;
}

void thread_coap_utils_peer_addr_clear(void)
{
    m_coap_status.peer_address = m_unspecified_ipv6;
}

bool thread_coap_utils_peer_addr_is_set(void)
{
    return (!otIp6IsAddressEqual(&m_coap_status.peer_address, &m_unspecified_ipv6));
}

void thread_coap_utils_mcast_light_on_set(bool value)
{
    m_coap_status.multicast_light_on = value;
}

bool thread_coap_utils_mcast_light_on_get(void)
{
    return m_coap_status.multicast_light_on;
}

void thread_coap_utils_mcast_light_on_toggle(void)
{
    m_coap_status.multicast_light_on = !m_coap_status.multicast_light_on;
}

void thread_coap_utils_unicast_light_request_send(otInstance * p_instance, uint8_t command)
{
    otError       error = OT_ERROR_NONE;
    otMessage   * p_message;
    otMessageInfo message_info;
    otCoapHeader  header;

    do
    {
        if (otIp6IsAddressEqual(&m_coap_status.peer_address, &m_unspecified_ipv6))
        {
            NRF_LOG_INFO("Failed to send the CoAP Request to the Unspecified IPv6 Address\r\n");
            break;
        }

        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
        otCoapHeaderGenerateToken(&header, 2);
        UNUSED_VARIABLE(otCoapHeaderAppendUriPathOptions(&header, "light"));
        UNUSED_VARIABLE(otCoapHeaderSetPayloadMarker(&header));

        p_message = otCoapNewMessage(p_instance, &header);
        if (p_message == NULL)
        {
            NRF_LOG_INFO("Failed to allocate message for CoAP Request\r\n");
            break;
        }

        error = otMessageAppend(p_message, &command, sizeof(command));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;
        memcpy(&message_info.mPeerAddr, &m_coap_status.peer_address, sizeof(message_info.mPeerAddr));

        error = otCoapSendRequest(p_instance,
                                  p_message,
                                  &message_info,
                                  NULL,
                                  p_instance);
    } while (false);

    if (error != OT_ERROR_NONE && p_message != NULL)
    {
        NRF_LOG_INFO("Failed to send CoAP Request: %d\r\n", error);
        otMessageFree(p_message);
    }
}

void thread_coap_utils_multicast_light_request_send(otInstance                        * p_instance,
                                                    uint8_t                             command,
                                                    thread_coap_utils_multicast_scope_t scope)
{
    otError       error = OT_ERROR_NONE;
    otMessage   * p_message;
    otMessageInfo message_info;
    otCoapHeader  header;
    const char  * p_scope = NULL;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_PUT);
        UNUSED_VARIABLE(otCoapHeaderAppendUriPathOptions(&header, "light"));
        UNUSED_VARIABLE(otCoapHeaderSetPayloadMarker(&header));

        p_message = otCoapNewMessage(p_instance, &header);
        if (p_message == NULL)
        {
            NRF_LOG_INFO("Failed to allocate message for CoAP Request\r\n");
            break;
        }

        error = otMessageAppend(p_message, &command, sizeof(command));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        switch (scope)
        {
        case THREAD_COAP_UTILS_MULTICAST_LINK_LOCAL:
            p_scope = "FF02::1";
            break;

        case THREAD_COAP_UTILS_MULTICAST_REALM_LOCAL:
            p_scope = "FF03::1";
            break;

        default:
            ASSERT(false);
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;
        UNUSED_VARIABLE(otIp6AddressFromString(p_scope, &message_info.mPeerAddr));

