KunYi/nRF5_SDK_Thread/examples/thread/app_utils/thread_coap_utils.c
        error = otCoapSendRequest(p_instance, p_message, &message_info, NULL, NULL);
    } while (false);

    if (error != OT_ERROR_NONE && p_message != NULL)
    {
        NRF_LOG_INFO("Failed to send CoAP Request: %d\r\n", error);
        otMessageFree(p_message);
    }
}

static void provisioning_response_handler(void                * p_context,
                                          otCoapHeader        * p_header,
                                          otMessage           * p_message,
                                          const otMessageInfo * p_message_info,
                                          otError               result)
{
    (void)p_context;
    (void)p_header;

    // restore the polling period back to initial slow value
    UNUSED_VARIABLE(poll_period_restore(thread_ot_instance_get()));

    if (result == OT_ERROR_NONE)
    {
        UNUSED_VARIABLE(otMessageRead(p_message,
                                      otMessageGetOffset(p_message),
                                      &m_coap_status.peer_address,
                                      sizeof(m_coap_status.peer_address))
        );
    }
    else
    {
        NRF_LOG_INFO("Provisioning failed: %d\r\n", result);
    }
}

void thread_coap_utils_provisioning_request_send(otInstance * p_instance)
{
    otError       error = OT_ERROR_NO_BUFS;
    otCoapHeader  header;
    otMessage   * p_request;
    otMessageInfo message_info;

    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_GET);
        otCoapHeaderGenerateToken(&header, 2);
        UNUSED_VARIABLE(otCoapHeaderAppendUriPathOptions(&header, "provisioning"));

        p_request = otCoapNewMessage(p_instance, &header);
        if (p_request == NULL)
        {
            break;
        }

        // decrease the polling period for higher responsiveness
        uint32_t err_code = poll_period_response_set(p_instance);
        if (err_code == NRF_ERROR_BUSY)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort    = OT_DEFAULT_COAP_PORT;
        UNUSED_VARIABLE(otIp6AddressFromString("FF03::1", &message_info.mPeerAddr));

        error = otCoapSendRequest(
            p_instance, p_request, &message_info, provisioning_response_handler, p_instance);

    } while (false);

    if (error != OT_ERROR_NONE && p_request != NULL)
    {
        otMessageFree(p_request);
    }

}

static void cloud_data_send(otInstance                            * p_instance,
                            const thread_coap_cloud_information_t * p_thread_coap_cloud_information,
                            char                                  * p_payload)
{
    otError       error;
    otCoapHeader  header;
    otCoapOption  content_format_option;
    otMessage   * p_request;
    otMessageInfo message_info;
    uint8_t content_format = p_thread_coap_cloud_information->cloud_coap_content_format;
    do
    {
        content_format_option.mNumber = OT_COAP_OPTION_CONTENT_FORMAT;
        content_format_option.mLength = 1;
        content_format_option.mValue  = &content_format;

        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_POST);
        UNUSED_VARIABLE(otCoapHeaderAppendUriPathOptions(&header, p_thread_coap_cloud_information->p_cloud_uri_path));
        UNUSED_VARIABLE(otCoapHeaderAppendOption(&header, &content_format_option));
        UNUSED_VARIABLE(otCoapHeaderSetPayloadMarker(&header));

        p_request = otCoapNewMessage(p_instance, &header);
        if (p_request == NULL)
        {
            NRF_LOG_INFO("Failed to allocate message for CoAP Request\r\n");
            break;
        }

        error = otMessageAppend(p_request, p_payload, strlen(p_payload));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

        memset(&message_info, 0, sizeof(message_info));
        message_info.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
        message_info.mPeerPort = OT_DEFAULT_COAP_PORT;
        message_info.mPeerAddr = m_coap_status.peer_address;

        error = otCoapSendRequest(p_instance, p_request, &message_info, NULL, NULL);

    } while (false);

    if (error != OT_ERROR_NONE && p_request != NULL)
    {
        NRF_LOG_INFO("Failed to send CoAP Request: %d\r\n", error);
        otMessageFree(p_request);
    }
}

void thread_coap_utils_cloud_data_update(
                        const thread_coap_cloud_information_t * p_thread_coap_cloud_information,
                        uint16_t                                data)
{
    char payload_buffer[64];

    sprintf(payload_buffer,
            "{\"values\":[{\"key\":\"%s\",\"value\":\"%d\"}]}",
            p_thread_coap_cloud_information->p_cloud_thing_resource, data);

    cloud_data_send(thread_ot_instance_get(), p_thread_coap_cloud_information, payload_buffer);
}

bool thread_coap_utils_provisioning_is_enabled(void)
{
    return m_coap_status.provisioning_enabled;
}

void thread_coap_utils_provisioning_enable(bool value)
{
    uint32_t error;

    m_coap_status.provisioning_enabled = value;

    if (value)
    {
        m_coap_status.provisioning_expiry = otPlatAlarmMilliGetNow() + PROVISIONING_EXPIRY_TIME;
        error = app_timer_start(m_provisioning_timer,
                                APP_TIMER_TICKS(PROVISIONING_EXPIRY_TIME),
                                NULL);
        ASSERT(error == NRF_SUCCESS);

        error = app_timer_start(m_led_timer, APP_TIMER_TICKS(LED_INTERVAL), NULL);
        ASSERT(error == NRF_SUCCESS);

        if (m_thread_coap_configuration.configurable_led_blinking_enabled)
        {
            m_light_changed(LIGHT_OFF);
        }
    }
    else
    {
        m_coap_status.provisioning_expiry = 0;

        error = app_timer_stop(m_provisioning_timer);
        ASSERT(error == NRF_SUCCESS);

        error = app_timer_stop(m_led_timer);
        ASSERT(error == NRF_SUCCESS);

        LEDS_OFF(BSP_LED_2_MASK);

        if (m_thread_coap_configuration.configurable_led_blinking_enabled)
        {
            error = app_timer_stop(m_led_timer);
            ASSERT(error == NRF_SUCCESS);

            if (m_coap_status.led_blinking_is_on)
            {
                m_light_changed(LIGHT_ON);
            }
            else
            {
                m_light_changed(LIGHT_OFF);
            }
        }
    }
}

static void thread_coap_utils_provisioning_timer_handler(void * p_context)
{
    thread_coap_utils_provisioning_enable(false);
}

void thread_coap_utils_provisioning_timer_init(void)
{
    uint32_t error = app_timer_create(&m_provisioning_timer,
                                      APP_TIMER_MODE_SINGLE_SHOT,
                                      thread_coap_utils_provisioning_timer_handler);
    ASSERT(error == NRF_SUCCESS);
}

otError thread_coap_utils_provisioning_response_send(void                * p_context,
                                                     otCoapHeader        * p_request_header,
                                                     const otMessageInfo * p_message_info)
{
    otError      error = OT_ERROR_NO_BUFS;
    otCoapHeader header;
    otMessage  * p_response;
    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_NON_CONFIRMABLE, OT_COAP_CODE_CONTENT);
        otCoapHeaderSetToken(&header,
                             otCoapHeaderGetToken(p_request_header),
                             otCoapHeaderGetTokenLength(p_request_header));
        UNUSED_VARIABLE(otCoapHeaderSetPayloadMarker(&header));

        p_response = otCoapNewMessage(thread_ot_instance_get(), &header);
        if (p_response == NULL)
        {
            break;
        }

        error = otMessageAppend(
            p_response, otThreadGetMeshLocalEid(thread_ot_instance_get()), sizeof(otIp6Address));
        if (error != OT_ERROR_NONE)
        {
            break;
        }

