KunYi/nRF5_SDK_Thread/examples/thread/app_utils/thread_coap_utils.c
        error = otCoapSendResponse(thread_ot_instance_get(), p_response, p_message_info);

    } while (false);

    if (error != OT_ERROR_NONE && p_response != NULL)
    {
        otMessageFree(p_response);
    }

    return error;
}

static void led_timer_handler(void * p_context)
{
    LEDS_INVERT(BSP_LED_2_MASK);
}

void thread_coap_utils_led_timer_init(void)
{
    LEDS_CONFIGURE(LEDS_MASK);
    LEDS_OFF(LEDS_MASK);

    uint32_t error = app_timer_create(&m_led_timer, APP_TIMER_MODE_REPEATED, led_timer_handler);
    ASSERT(error == NRF_SUCCESS);
}

void thread_coap_utils_light_response_send(void                * p_context,
                                           otCoapHeader        * p_request_header,
                                           const otMessageInfo * p_message_info)
{
    otError      error = OT_ERROR_NO_BUFS;
    otCoapHeader header;
    otMessage  * p_response;
    do
    {
        otCoapHeaderInit(&header, OT_COAP_TYPE_ACKNOWLEDGMENT, OT_COAP_CODE_CHANGED);
        otCoapHeaderSetMessageId(&header, otCoapHeaderGetMessageId(p_request_header));
        otCoapHeaderSetToken(&header,
                             otCoapHeaderGetToken(p_request_header),
                             otCoapHeaderGetTokenLength(p_request_header));

        p_response = otCoapNewMessage(p_context, &header);
        if (p_response == NULL)
        {
            break;
        }

        error = otCoapSendResponse(p_context, p_response, p_message_info);

    } while (false);

    if ((error != OT_ERROR_NONE) && (p_response != NULL))
    {
        otMessageFree(p_response);
    }
}

void thread_coap_utils_light_changed_callback_set(light_changed_handler_t handler)
{
    m_light_changed = handler;
}

void thread_coap_utils_light_blinking_is_on_set(bool value)
{
    m_coap_status.led_blinking_is_on = value;
}

bool thread_coap_utils_light_blinking_is_on_get(void)
{
    return m_coap_status.led_blinking_is_on;
}
